In [1]:
import pandas as pd
import numpy as np

In [41]:
original = pd.read_csv('../data/dataset.csv')

In [45]:
new = original.copy()
new['University'] = new['Name'].apply(lambda x: x.split(' ')[0])
new['Degree'] = new['Name'].apply(lambda x: ' '.join(x.split(' ')[1:]).replace('*', '')\
                                                                      .replace(' (Hons)', '')\
                                                                      .replace(' with Honours', '')\
                                                                      .replace(' Cum Laude and above', '')\
                                                                      .replace('Major8', 'Major')\
                                                                      .replace('Bachelor of ', '')\
                                                                      .replace('Master of Technology in ', '')\
                                                                      .replace('Master of Technology in ', '')\
                                                                      .replace('Laws', 'Law')\
                                                                      .replace('Double Degree in ', '')\
                                                                      .replace('(and Education)', 'and Education')\
                                                                      .strip())
new.drop('Name', inplace=True, axis=1)

In [46]:
new.head()

  University                        Degree
0        NUS                           Law
1        SMU                           Law
2        SMU                           Law
3        NUS  Computing (Computer Science)
4        SMU              Computer Science

In [48]:
new.to_csv('../data/df.csv', index=False)